001: ${3.14}<#-- 默认：number -->
001: ${3.14?string}<#-- 默认：number -->
002: ${3.14?string.number}
003: ${3.14?string.currency}
004: ${3.14?string.percent}

005: ${55.55?string("0")}
006: ${55.55?string("#")}
007: ${55.55?string("00")}
008: ${55.55?string("##")}
009: ${55.55?string("000")}
010: ${55.55?string("###")}
011: ${55.55?string("0.0")}
012: ${55.55?string("#.#")}
013: ${55.55?string("0.00")}
014: ${55.55?string("#.##")}
015: ${55.55?string("0.000")}
016: ${55.55?string("#.###")}

017: ${100000000?string}
018: ${100000000?string(",####")}

019: ${3.14?round}<#-- 四舍五入 -->
020: ${3.14?floor}<#-- 向下取整 -->
021: ${3.14?ceiling}<#-- 向上取整 -->

022: ${3.14?byte}
023: ${3.14?short}
024: ${3.14?int}
025: ${3.14?long}
026: ${3?float}
027: ${3?double}

028: ${1305575275540?number_to_date}
029: ${1305575275540?number_to_time}
030: ${1305575275540?number_to_datetime}
